app/views/genres/index.html.erb

<%
    @genres ||= Genre.all
---
SELECT `genres`.* FROM `genres`