app/views/order_details/_order_details_form.html.erb

SELECT `books`.* FROM `books`
---
    <%= od.label :Book_Name %>
    <%= od.collection_select :book_id,  Book.all, :id, :name%>