app/views/order_details/_order_detail.html.erb

<tr id = "<%= order_detail.id %>">
  <td><%= link_to Book.find(order_detail.book_id).name, edit_order_detail_path(:id => order_detail.id), :remote => true %></td>
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1