app/views/orders/_order.html.erb

  <td><%= number_with_precision(order.total_price, :precision => 2) %></td>
  <td><%= order.created_at %></td>
---
INSERT INTO `orders` (`created_at`, `customer_name`, `total_price`, `updated_at`) VALUES ('2015-08-03 18:42:39', 'Wen Li', 0.0, '2015-08-03 18:42:39')