app/views/orders/edit.html.erb

    <tdata>
      <%= render @order.order_details %>
---
SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 1