app/views/orders/show.html.erb

SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 2
---
  <tbody>
    <%=
        @order_details = @order.order_details