app/views/books/_form.erb

SELECT `authors`.* FROM `authors`
---
      <%= b.label :author %>
      <%= b.collection_select :author_id, Author.all, :id, :name %>

SELECT `subgenres`.* FROM `subgenres`
---
      <%= b.label :subgenre %>
      <%= b.collection_select :subgenre_id, Subgenre.all, :id, :name %>

SELECT `publishers`.* FROM `publishers`
---
      <%= b.label :publisher %>
      <%= b.collection_select :publisher_id, Publisher.all, :id, :name %>