app/views/books/_new.html.erb

      <%= b.label :author %>
      <%= b.collection_select :author_id, Author.all, :id, :name %>
---
SELECT `authors`.* FROM `authors`