app/views/subgenres/_form.html.erb

SELECT `genres`.* FROM `genres`
---
      <%= s.label :genre %>
      <%= s.collection_select :genre_id, Genre.all, :id, :name %>