app/views/subgenres/_new.html.erb

      <%= s.label :genre %>
      <%= s.collection_select :genre_id, Genre.all, :id, :name %>
---
SELECT `genres`.* FROM `genres`