app/controllers/authors_controller.rb

  def create
    @author = Author.create(params[:author])
---
INSERT INTO `authors` (`DOB`, `created_at`, `first_name`, `last_name`, `updated_at`) VALUES ('1234567890', '2015-07-28 15:29:56', 'aaa', 'aaa', '2015-07-28 15:29:56')

  def update
    if @author.update_attributes(params[:author])
---
UPDATE `authors` SET `first_name` = 'Frank', `last_name` = 'Underhill', `updated_at` = '2015-07-28 20:44:44' WHERE `authors`.`id` = 4

  def destroy
    Author.destroy(params[:id])
---
DELETE FROM `authors` WHERE `authors`.`id` = 1

  def find_author_by_id
    @author = Author.find(params[:id])
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1