app/controllers/books_controller.rb

INSERT INTO `books` (`author_id`, `created_at`, `name`, `price`, `publisher_id`, `subgenre_id`, `updated_at`, `year`) VALUES (1, '2015-08-03 13:52:33', 'Guide of Time Travelling', 13.0, 1, 1, '2015-08-03 13:52:33', '1995')
---
  def create
    @book = Book.create params[:book]

UPDATE `books` SET `name` = 'The Shinings', `year` = '1981', `updated_at` = '2015-07-31 14:12:17' WHERE `books`.`id` = 30
---
  def update
    @book.update_attributes(params[:book])

SELECT `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
---
  def find_book_by_id
    @book = Book.find(params[:id])