app/controllers/genres_controller.rb

INSERT INTO `genres` (`created_at`, `desc`, `name`, `updated_at`) VALUES ('2015-07-28 17:42:17', 'aaa', 'aa', '2015-07-28 17:42:17')
---
  def create
    Genre.create!(params[:genre])

UPDATE `genres` SET `name` = 'SF', `desc` = 'Science Fiction', `updated_at` = '2015-07-29 17:18:46' WHERE `genres`.`id` = 2
---
  def update
    if @genre.update_attributes(params[:genre])

SELECT `genres`.* FROM `genres`
---
  def index
    @genres = Genre.all

DELETE FROM `genres` WHERE `genres`.`id` = 1
---
  def destroy
    @genre.destroy

SELECT `genres`.* FROM `genres` WHERE `genres`.`id` = 1 LIMIT 1
---
  def find_genre_by_id
    @genre = Genre.find(params[:id])