app/controllers/order_details_controller.rb

  def create
    params[:order_detail][:unit_price] = Book.find(params[:order_detail][:book_id]).price
    @order_detail = OrderDetail.create(params[:order_detail])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
INSERT INTO `order_details` (`book_id`, `created_at`, `order_id`, `quantity`, `unit_price`, `updated_at`) VALUES (1, '2015-08-03 17:35:01', 2, 111, 1.0, '2015-08-03 17:35:01')

  def update
    @order_detail.update_attributes(params[:order_detail])
---
UPDATE `order_details` SET `quantity` = 333, `updated_at` = '2015-08-03 18:25:32' WHERE `order_details`.`id` = 5
UPDATE `orders` SET `total_price` = 51.98, `updated_at` = '2015-08-03 18:51:55' WHERE `orders`.`id` = 6

  def destroy
    @order_detail.destroy
---
DELETE FROM `order_details` WHERE `order_details`.`id` = 3

  def find_order_detail_by_id
    @order_detail = OrderDetail.find(params[:id])
---
SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`id` = 3 LIMIT 1