app/controllers/orders_controller.rb

INSERT INTO `orders` (`created_at`, `customer_name`, `total_price`, `updated_at`) VALUES ('2015-08-03 18:42:39', 'Wen Li', 0.0, '2015-08-03 18:42:39')
---
  def create
    @order = Order.create params[:order]

DELETE FROM `orders` WHERE `orders`.`id` = 1
---
  def destroy
    @order.destroy;

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 2 LIMIT 1
---
  def find_order_by_id
    @order = Order.find(params[:id])