app/controllers/publishers_controller.rb

INSERT INTO `publishers` (`created_at`, `desc`, `name`, `updated_at`) VALUES ('2015-07-28 17:09:00', 'aaa', 'aaaa', '2015-07-28 17:09:00')
---
  def create
    @publisher = Publisher.create params[:publisher]

SELECT `publishers`.* FROM `publishers`
---
  def index
    @publishers = Publisher.all

UPDATE `publishers` SET `desc` = 'bbb', `updated_at` = '2015-07-28 17:19:47' WHERE `publishers`.`id` = 1
---
  def update
    @publisher.update_attributes(params[:publisher])

DELETE FROM `publishers` WHERE `publishers`.`id` = 2
---
  def destroy
    @publisher.destroy

SELECT `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 2 LIMIT 1
---
  def find_publisher_by_id
    @publisher = Publisher.find(params[:id])