app/controllers/subgenres_controller.rb

INSERT INTO `subgenres` (`created_at`, `desc`, `genre_id`, `name`, `updated_at`) VALUES ('2015-07-29 15:19:12', 'BBB', 1, 'BBB', '2015-07-29 15:19:12')
---
  def create
    @subgenre = Subgenre.create!(params[:subgenre])

SELECT `subgenres`.* FROM `subgenres`
---
  def index
    @subgenres = Subgenre.all

UPDATE `subgenres` SET `name` = 'dafdsfa', `updated_at` = '2015-07-28 18:39:43' WHERE `subgenres`.`id` = 2
---
  def update
    @subgenre.update_attributes(params[:subgenre])

DELETE FROM `subgenres` WHERE `subgenres`.`id` = 1
---
  def destroy
    @subgenre.destroy!

SELECT `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` = 1 LIMIT 1
---
  def find_subgenre_by_id
    @subgenre = Subgenre.find(params[:id])